src_ext/Catalogs/УЗ_Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Тарифы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИсториюЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Catalogs/УЗ_Тарифы/Ext/ManagerModule.bsl
//Представление тарифа без истории цен: «Наименование (1 000,00 за 1 урок)». Порядок единиц — как считает урок
//(Документы.УЗ_Урок.ЦенаСтрокиУрока): сначала уроки, затем часы — прежде здесь часы были важнее, и тариф с обеими
//единицами показывался «за 1 час», а считался «за урок».
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	Если Данные.Ссылка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	Если Данные.Ссылка.ИспользоватьИсториюЦен Тогда
		Возврат;
	КонецЕсли;

	Если Данные.Ссылка.Сумма > 0 Тогда
		Если Данные.Ссылка.КоличествоУроков > 0 Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Данные.Ссылка.Наименование+ " ("
				+Формат(Данные.Ссылка.Сумма/Данные.Ссылка.КоличествоУроков,"ЧДЦ=2")+ " за 1 урок)";
		ИначеЕсли Данные.Ссылка.КоличествоЧасов > 0 Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Данные.Ссылка.Наименование+ " ("
				+Формат(Данные.Ссылка.Сумма/Данные.Ссылка.КоличествоЧасов,"ЧДЦ=2")+ " за 1 час)";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
